
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ПрочитатьСобытиеЗавершенияОбновления() Экспорт
	
	Результат = Истина;
	
	Попытка
		Результат =  Не Вычислить("ОбновлениеИнформационнойБазы.НеобходимоОбновлениеИнформационнойБазы()");
	Исключение
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

Функция ИнтервалОпроса() Экспорт
	Возврат 3;
КонецФункции

Функция ПрочитатьПараметрыЗапуска(Строка) Экспорт
	Возврат Строка;
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура Пауза(Время)
	
	ВремяЗавершения = ТекущаяДата() + Время;
	Пока ТекущаяДата() < ВремяЗавершения Цикл
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
